const Footer = () => {
  return (
    <div className="bg-primaryColor md:mb-0 mb-14 text-white p-5 w-full grid grid-cols-1 gap-5 md:grid-cols-3">
      <div className="flex flex-col items-start justify-start gap-5 md:col-span-2 col-span-1">
        <h6 className="text-xl font-medium">درباره مجموعه نایکی</h6>
        <p className="text-lg line-clamp-6 md:line-clamp-none">
          ففروشگاه اینترنتی مبیت از جمله عرضه‌کنندگان کالای دیجیتال در سراسر
          کشور است که انواع کالاهای دیجیتال از جمله گوشی موبایل، لپ تاپ، تبلت و
          لوازم جانبی گوشی را با قیمت مناسب و ضمانت اصالت کالا به فروش می‌رساند.
          فعالیت مبیت از سال 1393 به صورت رسمی آغاز شد و به لطف سالیان تجربه ما
          در زمینه فروش حضوری، توانستیم نیاز کاربران را به خوبی برآورده سازیم و
          تجربه متفاوتی را از خرید کالای دیجیتال برای کاربران رقم بزنیم. شما
          می‌توانید گوشی، لپ تاپ، تبلت و انواع لوازم جانبی مورد نظر خود را با
          مناسب‌ترین قیمت از مبیت خریداری کنید و در کوتاه‌ترین زمان ممکن آن را
          تحویل بگیرید. تیم پشتیبانی مبیت نیز همراه شما خواهد بود تا در مراحل
          خرید هر کالایی بهترین مشاوره را ارائه کند و تمامی سوالات شما را پس از
          خرید نیز پاسخگو باشد. فروشگاه اینترنتی مبیت علاوه بر ارائه خدمات به
          مصرف کنندگان امکان خرید عمده برای همکاران را نیز فراهم ساخته است؛
          البته تسویه مدت دار نیز جزئی از خدمات مبیت برای شماست تا بتوانید کالای
          فروشگاه خود را به راحتی و بدون هیچ گونه دغدغه‌ای در هر زمان تامین
          کنید.
        </p>
      </div>
      <div className="col-span-1">
        <h6 className="text-xl font-medium text-start md:text-center my-5 ">
          با نایکی ریاکت
        </h6>
        <ul className="flex text-lg flex-col items-start md:items-center justify-start gap-2">
          <li>درباره ما</li>
          <li>تماس با ما</li>
          <li>تماس با مدیریت</li>
          <li>فرصت های شغلی </li>
          <li>فروش عمده</li>
          <li>شعبه حضوری</li>
        </ul>
      </div>
    </div>
  );
};

export default Footer;
